Autodesk.Navisworks.Api.Tool
View tool enumeration.

Autodesk.Navisworks.Api.Tool.None
No active tool

Autodesk.Navisworks.Api.Tool.Select
Select

Autodesk.Navisworks.Api.Tool.SelectBox
Select Box

Autodesk.Navisworks.Api.Tool.RedlineFreehand
Redline Freehand

Autodesk.Navisworks.Api.Tool.RedlineLine
Redline Line

Autodesk.Navisworks.Api.Tool.RedlineEllipse
Redline Ellipse

Autodesk.Navisworks.Api.Tool.RedlineCloud
Redline Cloud

Autodesk.Navisworks.Api.Tool.RedlineLineString
Redline Line String

Autodesk.Navisworks.Api.Tool.RedlineTag
Redline Tag

Autodesk.Navisworks.Api.Tool.RedlineText
Redline Text

Autodesk.Navisworks.Api.Tool.RedlineErase
Redline Erase

Autodesk.Navisworks.Api.Tool.RedlineArrow
Redline Arrow

Autodesk.Navisworks.Api.Tool.MeasurePointToPoint
Measure Point To Point

Autodesk.Navisworks.Api.Tool.MeasurePointToMultiplePoints
Measure Point To Multiple Points

Autodesk.Navisworks.Api.Tool.MeasurePointLine
Measure Point Line

Autodesk.Navisworks.Api.Tool.MeasureAccumulate
Measure Accumulate

Autodesk.Navisworks.Api.Tool.MeasureAngle
Measure Angle

Autodesk.Navisworks.Api.Tool.MeasureArea
Measure Area

Autodesk.Navisworks.Api.Tool.MeasureSingle


Autodesk.Navisworks.Api.Tool.BasicViewObjectWheel
Basic View Object Wheel

Autodesk.Navisworks.Api.Tool.BasicTourBuildingWheel
Basic Tour Building Wheel

Autodesk.Navisworks.Api.Tool.FullNavigationWheel
Full Navigation Wheel

Autodesk.Navisworks.Api.Tool.MiniViewObjectWheel
Mini View Object Wheel

Autodesk.Navisworks.Api.Tool.MiniTourBuildingWheel
Mini Tour Building Wheel

Autodesk.Navisworks.Api.Tool.MiniFullNavigationWheel
Mini Full Navigation Wheel

Autodesk.Navisworks.Api.Tool.Full2DNavigationWheel
Full 2D Navigation Wheel

Autodesk.Navisworks.Api.Tool.CommonPan
Pan common across all Autodesk products

Autodesk.Navisworks.Api.Tool.CommonZoom
Zoom common across all Autodesk products

Autodesk.Navisworks.Api.Tool.CommonZoomWindow
Zoom Window common across all Autodesk products

Autodesk.Navisworks.Api.Tool.CommonOrbit
Orbit common across all Autodesk products

Autodesk.Navisworks.Api.Tool.CommonFreeOrbit
Free Orbit common across all Autodesk products

Autodesk.Navisworks.Api.Tool.CommonConstrainedOrbit
Constrained Orbit common across all Autodesk products

Autodesk.Navisworks.Api.Tool.CommonLookAt
Look At common across all Autodesk products

Autodesk.Navisworks.Api.Tool.CommonLookAround
Look Around common across all Autodesk products

Autodesk.Navisworks.Api.Tool.CommonWalk
Walk common across all Autodesk products

Autodesk.Navisworks.Api.Tool.CommonCenter
Center common across all Autodesk products

Autodesk.Navisworks.Api.Tool.NavigateFixed
Camera fixed in place

Autodesk.Navisworks.Api.Tool.NavigateFreeLookAround
Classic Navisworks Free Look Around (Swivel)

Autodesk.Navisworks.Api.Tool.NavigateFreeOrbit
Classic Navisworks Free Orbit (Examine)

Autodesk.Navisworks.Api.Tool.NavigateWalk
Classic Navisworks Walk

Autodesk.Navisworks.Api.Tool.NavigateFly
Classic Navisworks Fly

Autodesk.Navisworks.Api.Tool.NavigateConstrainedOrbit
Classic Navisworks Constrained Orbit (Turntable)

Autodesk.Navisworks.Api.Tool.NavigateZoom
Classic Navisworks Zoom

Autodesk.Navisworks.Api.Tool.NavigatePan
Classic Navisworks Pan

Autodesk.Navisworks.Api.Tool.NavigateConstrainedPan
Classic Navisworks Constrained Pan

Autodesk.Navisworks.Api.Tool.NavigateLookAround
Clasic Navisworks Look Around (Swivel)

Autodesk.Navisworks.Api.Tool.NavigateOrbit
Classic Navisworks Orbit

Autodesk.Navisworks.Api.Tool.NavigateZoomWindow
Classic Navisworks Zoom Window (Zoom Box)

Autodesk.Navisworks.Api.Tool.CustomToolPlugin
Functionality is provided by a ToolPlugin